#define _CRT_SECURE_NO_WARNINGS 1

//#include <stdio.h>
//void test1()
//{
//	printf("hehe\n");
//}
//void test2(const char* str)
//{
//	printf("%s\n", str);
//}
//int main()
//{
//	test1();            //实用（）作为函数调用操作符。
//	test2("hello bit.");//实用（）作为函数调用操作符。
//	return 0;
//}
//
//struct Stu
//{
//	char name[10];
//	int age;
//	char sex[5];
//	double score;
//};
//
//void set_age1(struct Stu stu)
//{
//	stu.age = 18;
//}
//
//void set_age2(struct Stu* pStu) {
//	pStu->age = 18;//结构成员访问
//}
//
//int main()
//{
//	struct Stu stu;
//	struct Stu* pStu = &stu;//结构成员访问
//
//	stu.age = 20;//结构成员访问
//	set_age1(stu);
//
//	pStu->age = 20;//结构成员访问
//	set_age2(pStu);
//	return 0;
//}
//#include <stdio.h>
//int main()
//{
//	int a = 10;
//	int b = 20;
//	int max = 0;
//	if (a >= b)
//		max = a;
//	else
//		max = b;
//	printf("%d\n", max);
//	max = (a >= b) ? (a) : (b);
//	printf("%d\n", max);
//	return 0;
//}
//#include <stdio.h>
//int main()
//{
//	int a = 0;
//	int b = 0;
//	if (a > 5)
//		b = 3;
//	else
//		b = -3;
//	b = ( a > 5 ) ? ( 3 ) : ( -3 );
//	return 0;
//}

//#include <stdio.h>
//	int main()
//{
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	//i = a++ && ++b && d++;
//	i = a++||++b||d++;
//	printf("a = %d\nb = %d\nc = %d\nd = %d\n", a, b, c, d);
//	//程序输出的结果是什么？
//	return 0;
//}


//#include <stdio.h>
//int main()
//{
//	int a = 0;//0//逻辑假默认值为0
//	int b = 10;//1//逻辑真默认值为1
//
//	int c = a && b;//0&&1//0逻辑与1为假默认为0
//	printf("%d\n", c);//0
//	return 0;
//}
//#include <stdio.h>
//int main()
//{
//	int a = 10;//1//逻辑真默认值为1
//	int b = 20;//1//逻辑真默认值为1
//
//	int c = a && b;//1&&1//1逻辑与1为真默认为1
//	printf("%d\n", c);//1
//	return 0;
//}
//#include <stdio.h>
//int main()
//{
//	int a = 11;//1011
//	a = a | (1 << 2);
//	//将二进制的第三位0改为1
//	//即改为1011//11改为1111//15
//	//00000000000000000000000000001011//11
//	//00000000000000000000000000000100//4//1<<2//00000000000000000000000000000001//00000000000000000000000000000100//4
//	//00000000000000000000000000001111//11 | 4 = 15
//	printf("%d\n", a);//15
//
//	a = a & (~(1 << 2));
//	//将二进制的第三位1改回0
//	//即将1111//15改为1011//11
//	//00000000000000000000000000001111//15
//	//11111111111111111111111111111011//~4
//	//00000000000000000000000000000100//4//1<<2//00000000000000000000000000000001//00000000000000000000000000000100//4
//	//00000000000000000000000000001011//11
//	printf("%d\n", a);//11
//	return 0;
//}
//#include <stdio.h>
//int main()
//{
//	int a = 0;
//	//000000000000000000000000补码
//	printf("%d\n", a);
//	//按（二进制补码）位取反
//	printf("%d\n", ~a);
//	//111111111111111111111111补码
//	//111111111111111111111110反码
//	//100000000000000000000001原码
//	//-1
//	return 0;
//}
//#include <stdio.h>
//int main()
//{
//	short s = 0;
//	int a = 10;
//	printf("%d\n", sizeof(s = a + 5));//2
//	printf("%d\n", s);//0
//	return 0;
//}
//#include <stdio.h>
//int main()
//{
//	int a = 10;
//	int* pa = &a;//将 a 的地址放入指针变量 pa 中
//	printf("%d\n", pa);//打印的是a的地址
//	return 0;
//}
//#include <stdio.h>
//int main()
//{
//	int a = 10;
//	printf("%d\n", &a);//打印的是a的地址
//	return 0;
//}
//#include <stdio.h>
//int main()
//{
//	int a = 10;
//	int b = -a;
//	printf("%d\n", b);
//	return 0;
//}
//#include <stdio.h>
//int main()
//{
//	int a = 10;
//	if (a)
//	{
//		printf("hehe\n");
//	}
//	return 0;
//}
//#include <stdio.h>
//int main()
//{
//	int a = 0;
//	if (!a)
//	{
//		printf("hehe\n");
//	}
//
//	return 0;
//}
//#include <stdio.h>
//int main()
//{
//	int a = 10;
//	printf("%d\n", !a);//0
//
//	int b = 0;
//	printf("%d\n", !b);//1
//	return 0;
//}
//#include <stdio.h>
//int main()
//{
//	int num = 0;
//	scanf("%d", &num);
//	int i = 0;
//	int count = 0;//计数
//	while (num)
//	{
//		count++;
//		num = num & (num - 1);
//	}
//	printf("%d\n", count);
//	return 0;
//}
//#include <stdio.h>
//int main()
//{
//	int num = 0;
//	scanf("%d", &num);
//	int count = 0;
//	int i = 0;
//	for (i = 0; i < 32; i++)
//	{
//		if (((num >> i )& 1) == 1)
//		{
//			count++;
//		}
//	}
//	printf("%d\n", count);
//	return 0;
//}
//#include <stdio.h>
//int main()
//{
//	int num = 0;
//	scanf("%d", &num);
//	int count = 0;
//	while (num)
//	{
//		if (num % 2 == 1)
//			count++;
//		num = num / 2;
//	}
//	printf("%d\n", count);//011//3//2
//	return 0;
//}
//#include <stdio.h>
//int main()
//{
//	int a = 10;
//	int b = 20;
//	printf("a=%d b=%d\n", a, b);
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//	printf("a=%d b=%d\n", a, b);
//	return 0;
//}
//#include <stdio.h>
//int main()
//{
//	int a = 10;
//	int b = 20;
//	printf("a=%d b=%d\n", a, b);
//	a = a + b;
//	b = a - b;
//	a = a - b;
//	printf("a=%d b=%d\n", a, b);
//	return 0;
//}
//#include <stdio.h>
//int main()
//{
//	int a = 10;
//	int b = 20;
//	printf("a=%d b=%d\n", a, b);
//	int tmp = a;
//	a = b;
//	b = tmp;
//	printf("a=%d b=%d\n", a, b);
//	return 0;
//}
//#include<stdio.h>
//int main()
//{
//	int a = 5;
//	//101
//	//0000000000000000000000101原码
//	//0000000000000000000000101反码
//	//0000000000000000000000101补码
//	int b = 3;
//	//011
//	//0000000000000000000000011原码
//	//0000000000000000000000011反码
//	//0000000000000000000000011补码
//	int c = a ^ b;
//	//按(二进制补码)位异或
//	// （101）异或（011） 
//	//相同为0
//	//相反为1
//	//0000000000000000000000101补码
//	//0000000000000000000000011补码
//	//101
//	//011
//	//110
//	printf("%d\n", c);//6
//
//	return 0;
//}
//#include<stdio.h>
//int main()
//{
//	int a = 5;
//	//101
//	//0000000000000000000000101原码
//	//0000000000000000000000101反码
//	//0000000000000000000000101补码
//	int b = 3;
//	//011
//	//0000000000000000000000011原码
//	//0000000000000000000000011反码
//	//0000000000000000000000011补码
//	int c = a | b;
//	//按(二进制补码)位或
//	// （101）或（011） 
//	//1或0（或1）都为1
//	//0或0 为 0
//	//0000000000000000000000101补码
//	//0000000000000000000000011补码
//	//101
//	//011
//	//111
//	printf("%d\n", c);//7
//
//	return 0;
//}
//#include<stdio.h>
//int main()
//{
//	int a = 5;
//	//101
//	//0000000000000000000000101原码
//	//0000000000000000000000101反码
//	//0000000000000000000000101补码
//	int b = 3;
//	//011
//	//0000000000000000000000011原码
//	//0000000000000000000000011反码
//	//0000000000000000000000011补码
//	int c = a & b;
//	//按(二进制补码)位与
//	// 与 ，1与1为1,0与1或0都为0
//	//0000000000000000000000101补码
//	//0000000000000000000000011补码
//	//101
//	//011
//	//001
//	printf("%d\n", c);//1
//
//	return 0;
//}
//#include<stdio.h>
//int main()
//{
//	//正数的原反补码都相同
//	//负数的原码加上符号位，数值位
//	//负数的反码，符号位不变，数值位按位取反
//	//负数的补码，反码+1
//	int a = 5;
//	//0000000000000000000000101原码
//	//0000000000000000000000101反码
//	//0000000000000000000000101补码
//	int b = a << 1;
//	//左边丢弃左边补0
//	//0000000000000000000001010补码
//	//0000000000000000000001010反码
//	//0000000000000000000001010原码
//	//10
//	printf("%d\n", b);
//	int c = a << 2;
//	//右边丢弃左边补原符号位
//	//0000000000000000000010100补码
//	//0000000000000000000010100反码
//	//0000000000000000000010100原码
//	//20
//	printf("%d\n", c);
//
//	return 0;
//}
//#include<stdio.h>
//int main()
//{
//	//正数的原反补码都相同
//	//负数的原码加上符号位，数值位
//	//负数的反码，符号位不变，数值位按位取反
//	//负数的补码，反码+1
//	int a = 16;
//	//0000000000000000000010000原码
//	//0000000000000000000010000反码
//	//0000000000000000000010000补码
//	int b = a >> 1;
//	//右边丢弃左边补原符号位
//	//0000000000000000000001000补码
//	//0000000000000000000001000反码
//	//0000000000000000000001000原码
//	//8
//	printf("%d\n", b);
//	int c = a >> 2;
//	//右边丢弃左边补原符号位
//	//0000000000000000000000100补码
//	//0000000000000000000000100反码
//	//0000000000000000000000100原码
//	//4
//	printf("%d\n", c);
//
//	return 0;
//}
//#include<stdio.h>
//int main()
//{
//	int a = -1;
//	//1000000000000000000000001原码
//	//1111111111111111111111110反码
//	//1111111111111111111111111补码
//	int b = a >> 1;
//	//右边丢弃左边补原符号位
//	//1111111111111111111111111补码
//	//-1
//	printf("%d\n", b);
//	return 0;
//}
//#include<stdio.h>
//int main()
//{
//	int a1 = 5 / 2;//商2余1//2//取商
//	printf("%d\n", a1);
//
//	int a2 = 5 % 2;//商2余1//1//取余
//	printf("%d\n", a2);
//
//	//float double(默认精确到小数点后6位)
//	float b = 5 / 2;//商2余1//2.000000
//	printf("%f\n", b);
//
//	//如果想要得到小数
//	//必须   5写为5.0    或   2写为2.0  或   1.0 * 5 / 2
//	float c = 5.0 / 2;//商2余1//2.500000
//	printf("%f\n", c);
//
//	return 0;
//}